app/controllers/articles_controller.rb

  def show
    # 以@开始的变量是实例变量，它属于特定的对象。可以在类或子类的方法中引用实例变量。
    # 以@@开始的变量是类变量。在类的定义中定义类变量，可以在类的特殊方法、实例方法等处对类变量进行引用／赋值
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]